yii2/function/仿照一个Module下两个登陆模块_source/company/modules/user/models/LoginForm.php

SELECT * FROM `user` WHERE (`status`=2) AND ((`username`='webmaster') OR (`email`='webmaster'))
---
    public function getUser()
    {
        if ($this->user === false) {
            $this->user = User::find()
                ->active()
                ->andWhere(['or', ['username'=>$this->identity], ['email'=>$this->identity]])
                ->one();